In [2]:
import pandas as pd
import requests
#us is a module that allows conversion of US state names to abrv. and back
import us

In [3]:
r = requests.get("https://gasprices.aaa.com/state-gas-price-averages/", headers={"User-Agent": "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_3) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.61 Safari/537.36"})
results=pd.read_html(r.text)
gas_table=results[0]
gas_table

                   State Regular Mid-Grade Premium  Diesel
0                 Alaska  $2.457    $2.557  $2.719  $2.413
1                Alabama  $1.820    $2.145  $2.474  $2.274
2               Arkansas  $1.815    $2.103  $2.391  $2.135
3                Arizona  $2.296    $2.569  $2.821  $2.500
4             California  $3.031    $3.208  $3.324  $3.305
5               Colorado  $2.361    $2.674  $2.947  $2.284
6            Connecticut  $2.093    $2.461  $2.676  $2.732
7   District of Columbia  $2.205    $2.680  $2.810  $2.835
8               Delaware  $2.070    $2.428  $2.661  $2.365
9                Florida  $2.021    $2.374  $2.667  $2.429
10               Georgia  $1.916    $2.241  $2.554  $2.489
11                Hawaii  $3.185    $3.329  $3.573  $4.008
12                  Iowa  $2.041    $2.187  $2.596  $2.184
13                 Idaho  $2.324    $2.494  $2.683  $2.320
14              Illinois  $2.318    $2.652  $3.046  $2.407
15               Indiana  $2.090    $2.397  $2.721  $2.506
16                Kansas  $1.909    $2.159  $2.399  $2.078
17              Kentucky  $1.998    $2.325  $2.644  $2.327
18             Louisiana  $1.787    $2.091  $2.404  $2.245
19         Massachusetts  $2.055    $2.409  $2.611  $2.630
20              Maryland  $2.144    $2.564  $2.809  $2.417
21                 Maine  $2.079    $2.407  $2.659  $2.521
22              Michigan  $2.101    $2.418  $2.750  $2.439
23             Minnesota  $2.033    $2.240  $2.559  $2.339
24              Missouri  $1.850    $2.090  $2.351  $2.009
25           Mississippi  $1.759    $2.053  $2.367  $2.115
26               Montana  $2.114    $2.342  $2.591  $2.179
27        North Carolina  $1.983    $2.317  $2.633  $2.419
28          North Dakota  $2.047    $2.247  $2.469  $2.087
29              Nebraska  $1.988    $2.100  $2.431  $2.176
30         New Hampshire  $2.039    $2.413  $2.665  $2.535
31            New Jersey  $2.101    $2.496  $2.676  $2.522
32            New Mexico  $1.984    $2.280  $2.532  $2.373
33                Nevada  $2.560    $2.754  $2.934  $2.596
34              New York  $2.224    $2.550  $2.780  $2.836
35                  Ohio  $2.118    $2.419  $2.751  $2.441
36              Oklahoma  $1.839    $2.084  $2.278  $2.010
37                Oregon  $2.572    $2.738  $2.919  $2.601
38          Pennsylvania  $2.342    $2.646  $2.923  $2.750
39          Rhode Island  $2.059    $2.431  $2.663  $2.699
40        South Carolina  $1.857    $2.193  $2.505  $2.257
41          South Dakota  $2.039    $2.093  $2.400  $2.187
42             Tennessee  $1.880    $2.208  $2.526  $2.314
43                 Texas  $1.828    $2.151  $2.437  $2.108
44                  Utah  $2.270    $2.430  $2.601  $2.272
45              Virginia  $1.895    $2.280  $2.568  $2.370
46               Vermont  $2.070    $2.420  $2.676  $2.511
47            Washington  $2.669    $2.879  $3.039  $2.698
48             Wisconsin  $2.071    $2.376  $2.773  $2.109
49         West Virginia  $2.104    $2.364  $2.655  $2.394
50               Wyoming  $2.067    $2.284  $2.505  $2.343

In [4]:
type(gas_table)

pandas.core.frame.DataFrame

In [5]:
#Make the column headers lower case to match SQL database
gas_table.columns = map(str.lower, gas_table.columns)

In [6]:
#The cost of gas is a string, need to convert
type(gas_table['regular'][1])

str

In [7]:
cols = ['regular','mid-grade','premium','diesel']

In [8]:
#drop state to lower_case
gas_table["state"] = gas_table["state"].str.lower()

In [9]:
for name in cols:
    gas_table[name] = gas_table[name].str.replace("$","")

In [10]:
gas_table.head()

        state regular mid-grade premium diesel
0      alaska   2.457     2.557   2.719  2.413
1     alabama   1.820     2.145   2.474  2.274
2    arkansas   1.815     2.103   2.391  2.135
3     arizona   2.296     2.569   2.821  2.500
4  california   3.031     3.208   3.324  3.305

In [11]:
#Change to float and round
for name in cols:
    gas_table[name] = gas_table[name].astype(float).round(2)

In [12]:
#convert states to abbr. to match craigslist

state_abbr = []

for i in range(len(gas_table['state'])):
    state = us.states.lookup(gas_table['state'][i])
    state_abbr.append(state.abbr)

In [13]:
#replace the column state with abbr.
gas_table['state'] = state_abbr

In [14]:
#drop state to lower_case
gas_table["state"] = gas_table["state"].str.lower()

In [15]:
gas_table.head()

  state  regular  mid-grade  premium  diesel
0    ak     2.46       2.56     2.72    2.41
1    al     1.82       2.14     2.47    2.27
2    ar     1.82       2.10     2.39    2.13
3    az     2.30       2.57     2.82    2.50
4    ca     3.03       3.21     3.32    3.30

In [16]:
#write the df to csv for importation into sql
gas_table.to_csv('../Resources/final_gas.csv', index=False)